Router(config)#hostname MATRIZ_TUB			// seta um id para o equipamento
MATRIZ_TUB(config)#end
%SYS-5-CONFIG_I: Configured from console by console
MATRIZ_TUB#copy r s
Destination filename [startup-config]? 
Building configuration...
[OK]


MATRIZ_TUB(config)#service password-encryption		// ativa o serviço de cripografia de senhas
MATRIZ_TUB(config)#end
%SYS-5-CONFIG_I: Configured from console by console
MATRIZ_TUB#copy r s
Destination filename [startup-config]? 
Building configuration...
[OK]


EMPRESA(config)#line console 0				// ativa senha na porta do console
EMPRESA(config-line)#password cisco1			// seta a senha
EMPRESA(config-line)#login				// faz com que ele peça a senha no login
EMPRESA(config-line)#end				// volta para o prompt principal
%SYS-5-CONFIG_I: Configured from console by console
EMPRESA#copy run star
EMPRESA#copy run startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]



EMPRESA(config)#enable password cisco			// ativa senha (somente texto) para o modo privilegiado
EMPRESA(config)#exit					
%SYS-5-CONFIG_I: Configured from console by console	
EMPRESA#copy r s					
EMPRESA#copy r startup-config 				
Destination filename [startup-config]? 			
Building configuration...
[OK]


EMPRESA(config)#enable secret cisco2			// ativa criptografia de senha para modo provilegiado
EMPRESA(config)#exit
%SYS-5-CONFIG_I: Configured from console by console
EMPRESA#copy r s					// salva as configurações
Destination filename [startup-config]? 			// [enter] salva no próprio routeador
Building configuration...
[OK]


EMPRESA(config)#line vty 0 4				// ativa configuração via acesso remoto (telnet)
EMPRESA(config-line)#password cisco3			// seta a senha
EMPRESA(config-line)#login				// faz com que ele peça a senha no login
EMPRESA(config-line)#end
%SYS-5-CONFIG_I: Configured from console by console
EMPRESA#copy r s
Destination filename [startup-config]? 
Building configuration...
[OK]


EMPRESA(config)#interface fast 0/0				// seleciona a porta do routeador
EMPRESA(config-if)#ip address 192.198.1.1 255.255.255.0		// seta o endereço IP e a máscara de sub-rede
MATRIZ_TUB(config-if)#description 
	CONEXAO LAN SWITCH_2950_24 - CONTATO: JAKSON		// efetua documentação
EMPRESA(config-if)#no shutdown					// ativa a porta do routeador
EMPRESA(config-if)#no shutdown 	
EMPRESA(config-if)#end
%SYS-5-CONFIG_I: Configured from console by console
EMPRESA#copy r s
Destination filename [startup-config]? 
Building configuration...
[OK]


MATRIZ_TUB(config)#interface serial 0/0/0			// acessa a interface serial 0/0/0
MATRIZ_TUB(config-if)#ip address 200.1.1.1 255.255.255.0	// seta endereçamento IP
MATRIZ_TUB(config-if)#description 
		CONEXAO ISP - CCTO 333 - CONTATO: RODRIGO

ISP(config-if)#clock rate 64000					// seta largura da banda
MATRIZ_TUB(config)#ip route 0.0.0.0 0.0.0.0 serial 0/0/0	// configura uma rota


REDETUB#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
REDETUB(config)#ip host PC1 10.1.1.2				// cria tabela de DNS (tabela de resolução de nomes)
REDETUB(config)#ip host PC2 10.1.1.3				//
REDETUB(config)#ip host PC3 10.1.1.4				//
REDETUB(config)#ip host PC4 10.1.1.5				//
REDETUB(config)#end
%SYS-5-CONFIG_I: Configured from console by console
REDETUB#copy r s
Destination filename [startup-config]? 
Building configuration...
[OK]


REDETUB(config)#banner motd #					// cria banner para acesso remoto (telnet)
Enter TEXT message.  End with the character '#'.
+++++++++++++++++++++++++++++++++++++++++++++++
    REDE PRIVADA
    PERMISSAO SOMENTE USUARIOS AUTORIZADOS
+++++++++++++++++++++++++++++++++++++++++++++++#

REDETUB(config)#end
%SYS-5-CONFIG_I: Configured from console by console
REDETUB#copy r s
Destination filename [startup-config]? 
Building configuration...
[OK]


// Protocoles de roteamento dinâmico


LOJA_01(config)#router rip
LOJA_01(config-router)#network 210.1.1.0
LOJA_01(config-router)#network 192.168.20.0
LOJA_01(config-router)#

PEDAGOGICO(config)#router eigrp 100
PEDAGOGICO(config-router)#network 192.168.40.0
PEDAGOGICO(config-router)#network 192.168.3.0
PEDAGOGICO(config-router)#network 192.168.30.0


// Criando V_LANS

SWITCH_TI#vlan database
% Warning: It is recommended to configure VLAN from config mode,
  as VLAN database mode is being deprecated. Please consult user
  documentation for configuring VTP/VLAN in config mode.

SWITCH_TI(vlan)#vlan 2 name GERENCIA
VLAN 2 added:
    Name: GERENCIA
SWITCH_TI(vlan)#exit
APPLY completed.

// Configurando as V_Lans

SWITCH_TI#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SWITCH_TI(config)#interface fastethernet 0/4
SWITCH_TI(config-if)#switchport mode access
SWITCH_TI(config-if)#switchport access vlan 2
SWITCH_TI(config-if)#interface fastethernet 0/5
SWITCH_TI(config-if)#switch mode access
SWITCH_TI(config-if)#switch access vlan 2
SWITCH_TI(config-if)#end
%SYS-5-CONFIG_I: Configured from console by console
SWITCH_TI#


